---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.RegenerationFailedException
source: html/7b5582e2-d4ab-d55b-9629-e79a6cf53431.htm
---
# RegenerationFailedException Methods

Retrieves data needed to serialize the target object.